uft-ai-demo/APITest1/Result1/Report/Data/Step2.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">GetFlights</td><td class="value col-head-style">StServiceCallActivity4</td><td class="value col-head-style">Done</td><td class="value col-head-style">Web service call performed successfully</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_InputXml_97d5ceb7-3f9b-4237-9455-6af5615b0afc.xml\', \'Data/StServiceCallActivity4_InputXml_97d5ceb7-3f9b-4237-9455-6af5615b0afc-js4hrpt.js\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;Body&gt;\r\n    &lt;GetFlights xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;\r\n      &lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;\r\n      &lt;FlightDate&gt;2021-03-16T00:00:00+00:00&lt;/FlightDate&gt;\r\n    &lt;/GetFlights&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">Flights_Service</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">FlightsServiceMethods</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">GetFlights</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8000/Flights_SOAP</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_Full_request_500f3b69-60bb-443b-9749-fa7d7350298a.xml\', \'Data/StServiceCallActivity4_Full_request_500f3b69-60bb-443b-9749-fa7d7350298a-js4hrpt.js\', \'.xml\', \'Full request\');return false;">&lt;?xml version="1.0"? ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8000\nContent-Length:	258\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	2401\nContent-Type:	text/xml; charset=utf-8\nDate:	Fri, 12 Mar 2021 14:28:30 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;04:31 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;11121&lt;/FlightNumber&gt;&lt;Price&gt;111&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;10:31 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;&lt;DepartureTime&gt;09:48 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;11427&lt;/FlightNumber&gt;&lt;Price&gt;170.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;06:55 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;&lt;DepartureTime&gt;06:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;11836&lt;/FlightNumber&gt;&lt;Price&gt;106.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;05:43 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;&lt;DepartureTime&gt;05:00 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;12001&lt;/FlightNumber&gt;&lt;Price&gt;114.6&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:07 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;&lt;DepartureTime&gt;07:24 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;13225&lt;/FlightNumber&gt;&lt;Price&gt;172.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;SR&lt;/Airline&gt;&lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:45 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;13488&lt;/FlightNumber&gt;&lt;Price&gt;162.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;SR&lt;/Airline&gt;&lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:09 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:24 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;13492&lt;/FlightNumber&gt;&lt;Price&gt;165.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;SR&lt;/Airline&gt;&lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:33 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;13496&lt;/FlightNumber&gt;&lt;Price&gt;161.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;SR&lt;/Airline&gt;&lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:57 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;13500&lt;/FlightNumber&gt;&lt;Price&gt;162.3&lt;/Price&gt;&lt;/Flight&gt;&lt;/GetFlightsResult&gt;&lt;/GetFlightsResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">200 : OK</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_OutputXml_f8494439-6d7b-4153-9e7d-81cff455015d.xml\', \'Data/StServiceCallActivity4_OutputXml_f8494439-6d7b-4153-9e7d-81cff455015d-js4hrpt.js\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;04:31 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;03:48 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;11121&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;111&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;10:31 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;09:48 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;11427&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;170.47&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;06:55 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;06:12 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;11836&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;106.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;05:43 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;05:00 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;12001&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;114.6&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;08:07 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;07:24 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;13225&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;172.47&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;SR&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;08:45 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;13488&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;162.4&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;SR&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;11:09 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;10:24 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;13492&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;165.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;SR&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;01:33 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;13496&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;161.4&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;SR&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;London&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;03:57 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Frankfurt&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;13500&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;162.3&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n      &lt;/GetFlightsResult&gt;\r\n    &lt;/GetFlightsResponse&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr> </table></div></div>';}